Revit 2027 API
Subelement.IsValidType Method
 Checks if given type is valid for this subelement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidType(
	ElementId typeId
)
Public Function IsValidType (
	typeId As ElementId
) As Boolean
public:
bool IsValidType(
	ElementId^ typeId
)
member IsValidType :
        typeId : ElementId -> bool
Parameters
typeId ElementId
 ElementId of the type to check.
Return Value
Boolean
 True if subelement can have a type assigned and this type is valid for this subelement, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 A type is valid for a subelement if it can be assigned to the subelement.
See Also
Reference
Subelement Class
Autodesk.Revit.DB Namespace